const greet = require('./index');

    test('возвращает "Доброе утро" при 8 часах утра', () => {
        expect(greet("Иван", 8)).toBe("Доброе утро, Иван!");
    });

    test('возвращает "Добрый день" при 14 часах дня', () => {
        expect(greet("Иван", 14)).toBe("Добрый день, Иван!");
    });

    test('возвращает "Добрый вечер" при 19 часах', () => {
        expect(greet("Иван", 19)).toBe("Добрый вечер, Иван!");
    });

    test('возвращает "Доброй ночи" при 23 часах ночи', () => {
        expect(greet("Иван", 23)).toBe("Доброй ночи, Иван!");
    });
